Repository: colinkiama/code
Catalog: po/*.po
Languages: ckb

source: New Tab
ckb: تابی نوێ

source: New Window
ckb: پەنجەرەی نوێ

source: Print version info and exit
ckb: پرێنت کردنی زانیاری وەشان و داخستن

source: Set of plugins
ckb: دەستەی پێوەکراوەکان

source: plugin
ckb: پێوەکراو

source: [FILE…]
ckb: [پەڕگە...]

source: Code
ckb: كۆد

source: Hide search bar
ckb: شاردنەوەی شریتی گەڕان

source: All files
ckb: هەموو پەڕگەکان

source: Text files
ckb: پەڕگە دەقییەکان

source: Open some files
ckb: کردنەوەی چەند پەڕگەیەک

source: Open
ckb: كردنەوە

source: Cancel
ckb: هەڵوەشاندنەوە

source: _Open
ckb: _کردنەوە

source: _Cancel
ckb: _هەڵوەشاندنەوە

source: Search for text in “%s”
ckb: گەڕان بۆ دەق لە "%s"

source: The search term must be at least 3 characters long.
ckb: وشەی گەڕان دەبێت لانیەک ٣ پیت ببێت.

source: Case sensitive:
ckb: هەستیاری کەیس:

source: Use regular expressions:
ckb: دەستەواژە ئاساییەکان بەکاربهێنە:

source: Search
ckb: گەڕان

source: Create a new branch of “%s/%s”
ckb: دروستکردنی لقێکی نوێی “%s/%s”

source: The branch name must be unique and follow Git naming rules.
ckb: ناوی لق دەبێت بێ هاوتا بێت و شوێن یاساکانی ناونای گیت بکەوێت.

source: Create Branch
ckb: دروستکردنی لق

source: Preferences
ckb: هەڵبژاردەکان

source: Cutting or copying without an active selection will cut or copy the entire current line
ckb: بڕین یان لەبەرگرتنەوە بەبێ دیاریکردنێکی چالاک، بۆ تەواوی هێڵەکە ئەنجام دەدرێت

source: General
ckb: گشتی

source: Save files when changed:
ckb: پەڕگەکان پاشەکەوت بکە کاتێک کە گۆڕدران:

source: Smart cut/copy lines:
ckb: بڕین/لەبەرگرتنەوەی زیرەکی هێڵەکان:

source: Tabs
ckb: تابەکان

source: Automatic indentation:
ckb: دانانی خۆکارانەی بۆشایی سەرەتای دێڕ:

source: Insert spaces instead of tabs:
ckb: لەجیاتی تابەکان بۆشاییەکان دابنێ:

source: Tab width:
ckb: پانایی تابەکان:

source: Behavior
ckb: هەڵسوکەوت

source: Interface
ckb: ڕووكار

source: Close
ckb: داخستن

source: Extensions
ckb: زیادکراوەکان

source: Editor
ckb: دەستکاریکەر

source: Highlight matching brackets:
ckb: بەرچاوکردنی کەوانە لەیەکچووەکان:

source: Line wrap:
ckb: پێچانەوەی دێڕ:

source: Visible whitespace:
ckb: بۆشایی سپی بەرچاو:

source: Show Mini Map:
ckb: پیشاندانی نەخشۆکە:

source: Line width guide:
ckb: ڕێبەری پانایی دێڕەکان:

source: Font
ckb: فۆنت

source: Custom font:
ckb: فۆنتی تایبەت:

source: Are You Sure You Want to Restore This File?
ckb: دڵنیایت لە گەڕاندنەوەی ئەم پەڕگەیە؟

source: Restoring a file will undo all changes made since opening it
ckb: گەڕاندنەوەی پەڕگەیەک گۆڕانکاییەکان هەڵدەوەشێنتەوە کە ئەنجامت داون لەو کاتەوەی کە کردوتەوە

source: Don't Restore
ckb: مەیگەڕێنەوە

source: Restore Anyway
ckb: هەرچۆنێک بێت بیگەڕێنەوە

source: Other Application…
ckb: ئەپڵیکەیشنەکانی تر…

source: Open In
ckb: كردنەوە لە

source: Other Actions
ckb: کردارەکانی تر

source: Rename
ckb: ناوگۆڕین

source: Move to Trash
ckb: ناردنی بۆ تەنەکە

source: Folders
ckb: بوخچەکان

source: Find in Folder…
ckb: دۆزینەوە لە بوخچەدا…

source: Folder
ckb: بوخچە

source: Empty File
ckb: پەڕگەی بەتاڵ

source: New
ckb: نوێ

source: untitled folder
ckb: بوخچەی بێ ناو

source: new file
ckb: پەڕگەیەکی نوێ

source: Close Folder
ckb: داخستنی بوخچە

source: Close Other Folders
ckb: داخستنی بوخچەکانی تر

source: Find in Project…
ckb: دۆزینەوە لە پرۆژەدا…

source: Modified
ckb: دەستکاریکراو

source: Error while creating new branch: “%s”
ckb: هەڵەیەک ڕوویدا لە کاتی دروستکردنی برانچێکی نوێ: "%s"

source: New Branch…
ckb: برانچی نوێ…

source: Branch
ckb: برانچ

source: %s Is Not a Text File
ckb: %s پەڕگەیەکی دەقی نییە

source: Code will not load this type of file.
ckb: کۆد ئەم جۆری پەڕگەیە ناکاتەوە.

source: Load Anyway
ckb: هەرچۆنێک بێت بیکەوە

source: Loading File "%s" Is Taking a Long Time
ckb: کردنەوەی پەڕگەی "%s" کاتێکی زۆری دەوێت

source: Please wait while Code is loading the file.
ckb: تکایە چاوەڕێ بکە کاتێک کۆد خەریکی کردنەوەی پەڕگەکەیە.

source: Cancel Loading
ckb: هەڵوەشاندنەوەی کردنەوە

source: Save changes to "%s" before closing?
ckb: دەتەوێت گۆڕانکارییەکانی پەڕگەی "%s" پاشەکەوت بکرێن؟

source: If you don't save, changes will be permanently lost.
ckb: ئەگەر پاشەکەوتی نەکەیت، گۆڕانکارییەکان بۆ هەمیشە لە دەست دەدەیت.

source: Close Without Saving
ckb: داخستن بەبێ پاشەکەوت کردن

source: Save
ckb: پاشه‌كه‌وت كردن

source: Save File
ckb: پاشەکەوتکردنی پەڕگە

source: New Document
ckb: پەڕگەیەکی نوێ

source: File "%s" Cannot Be Read
ckb: پەڕگەی "%s" ناخوێندرێتەوە

source: It may be corrupt or you don't have permission to read it.
ckb: لەوانەیە تێکچوو بێت یاخود مۆڵەتی کردنەوەیت نەبێت.

source: The location containing the file "%s" was unmounted. Do you want to save somewhere else?
ckb: شوێنی هەڵگری پەڕگەی "%s" ناجێگیر کرا. ئایا دەتەوێت لە شوێنێکی تر پاشەکەوتی بکەیت؟

source: Save As…
ckb: پاشەکەوتکردن وەکو…

source: File "%s" was deleted. Do you want to save it anyway?
ckb: پەڕگەی "%s" سڕدرایەوە. دەتەوێت هێشتا پاشەکەوتی بکەیت؟

source: You cannot save changes to the file "%s". Do you want to save the changes somewhere else?
ckb: ناتوانی گۆڕانکارییەکانی پەڕگەی "%s" پاشەکەوت بکەیت. دەتەوێت گۆڕانکارییەکانی ئەم پەڕگەیە لەشوێنێکی تر پاشەکەوت بکەیت؟

source: Save changes elsewhere
ckb: پاشەکەوتکردنی گۆڕانکارییەکان لەشوێنێکی دی

source: File "%s" was modified by an external application. Do you want to load it again or continue your editing?
ckb: پەڕگەی "%s" لەلایەن نەرمەکاڵایەکی دەرەکییەوە گۆڕدراوە. ئایا دەتەوێت دووبارە بیکەیتەوە یاخود دەتەوێت بەردەوامبیت لە دەستکاریکردنی پەڕەی دیاریکراو؟

source: Load
ckb: بارکردن

source: Continue
ckb: به‌رده‌وام به‌

source: Templates
ckb: داڕێژراوەکان

source: Symbols
ckb: سمبولەکان

source: No Project Selected
ckb: هیچ پڕۆژەیەک دیارینەکراوە

source: Active Git project: %s
ckb: پڕۆژەی کارای گیت: %s

source: Filter projects
ckb: فلتەرکردنی پڕۆژەکان

source: Text file from %s:%d
ckb: پەڕگەی دەقی لە %s:%d

source: Syntax Highlighting
ckb: بەرچاوکردنی ڕستەکار

source: Line number
ckb: ژمارەی دێڕ

source: Filter languages
ckb: فلتەرکردنی زمانەکان

source: Plain Text
ckb: دەقی خاو

source: Go To Line:
ckb: بڕۆ بۆ دێڕی:

source: %d Space
ckb: %d بۆشایی

source: %d Tab
ckb: %d تاب

source: Open a file
ckb: کردنەوەی پەڕگەیەک

source: Project templates
ckb: پڕۆژەی داڕێژراوەکان

source: Save this file
ckb: پاشەکەوتکردنی ئەم پەڕگەیە

source: Save this file with a different name
ckb: پاشەکەوتکردنی ئەم پەڕگەیە بەناوێکی جیاواز

source: Restore this file
ckb: هێنانەوەی ئەم پەڕگەیە

source: Share
ckb: هاوبەشیکردن

source: Zoom Out
ckb: بردنە دوا (زووم)

source: Zoom 1:1
ckb: وردبیناندن (زووم) 1:1

source: Zoom In
ckb: هێنانەپێش (زووم)

source: Follow System Style
ckb: هەمان ستایلی سیستەم هەڵگرە

source: Show Terminal
ckb: پیشاندانی تێرمیناڵ

source: Menu
ckb: لیست

source: Hide Terminal
ckb: شاردنەوەی تێرمیناڵ

source: Collapse All
ckb: کۆکردنەوەی هەموو

source: Alphabetize
ckb: ئەلفبێکردن

source: Manage project folders
ckb: بەڕێوەبردنی بوخچەکانی پڕۆژە

source: Find
ckb: دۆزینه‌وه‌

source: no results
ckb: هیچ ئەنجامێک نییە

source: Search next
ckb: گەڕان بۆ دواتر

source: Search previous
ckb: گەڕان بۆ پێشتر

source: Cyclic Search
ckb: گەڕانی خولی

source: Case Sensitive
ckb: هەستیارە کەیس

source: Case Insensitive
ckb: ناهەستیارە کەیس

source: Use regular expressions
ckb: بەکارهێنانی دەستەواژەی ئاسایی

source: Replace With
ckb: جێ گۆڕینەوە لەگەڵ

source: Replace
ckb: جێ گۆڕینەوە

source: Replace all
ckb: جێ گۆڕینەوەی هەموویان

source: %d of %d
ckb: %d ی %d

source: Sort Selected Lines
ckb: ڕیزکردنی هێڵە دیاریکراوەکان

source: Toggle Comment
ckb: کردنەوەی/داخستنی کۆمێنت

source: Copy
ckb: لەبەرگرتنەوە

source: Paste
ckb: لکاندن

source: No Files Open
ckb: هیچ پەڕگەیەک نەکراوەتەوە

source: Open a file to begin editing.
ckb: پەڕگەیەک بکەرەوە تاوەکوو دەست بە نووسینی بکەیت.

source: New File
ckb: پەڕگەی نوێ

source: Create a new empty file.
ckb: پەڕگەیەکی نوێی بەتاڵ درووست بکە.

source: Open File
ckb: کردنەوەی پەڕگە

source: Open a saved file.
ckb: کردنەوەی پەڕگەی پاشەکەوتکراو.

source: Open Folder
ckb: کردنەوەی بوخچە

source: Add a project folder to the sidebar.
ckb: زیادکردنی بوخچەی پڕۆژەیەک بۆ سایدباڕ.

source: Upload to Pastebin
ckb: بارکردنی بۆ پەیست بین

source: Name:
ckb: ناو:

source: Format:
ckb: فۆڕمات:

source: Choose different format
ckb: فۆڕماتێکی جیاواز هەڵبژێرە

source: Expiration:
ckb: بەسەرچوون:

source: Keep this paste private
ckb: ئەم لکاندنە بە نهێنی بهێڵەوە

source: Available Formats
ckb: فۆڕماتە بەردەستەکان

source: Select Format
ckb: فۆڕمات دیاریبکە

source: Never
ckb: هەرگیز

source: Ten minutes
ckb: ١٠ خولەک

source: One hour
ckb: یەک کاتژمێر

source: One day
ckb: یەک ڕۆژ

source: One month
ckb: یەک مانگ

source: No Suitable Dictionaries Were Found
ckb: هیچ فەرهەنگێکی گونجاو نەدۆزرایەوە

source: Please install at least one [aspell] dictionary.
ckb: تکایە لانیەکم یەک فەرهەنگی [aspell] دابمەزرێنە.

source: %s - Word Completion
ckb: %s - تەواوکاری وشە
